{
  "main": {
    "changes": [
      "Deduplicated the PDF quick reference section for when nested profiles are also included as a standalone profile."
    ],
    "bugfixes": [
      "Fixed a data formatting error on the Uruk-Hai Demolition Team, causing the PDF page to crash.",
      "Corrected the name of Moria Goblin to Moria Goblin Warrior, for Warg Marauders on the PDF printout.",
      "Added missing Expert Shot special rule to Drar in the Murin & Drar profile.",
      "Fix issue not being able to select The White Warg on Azog from the Azog's Hunters army list.",
      "Fixed typo in the special rules from Cirdan",
      "Fixed issue with Bill Ferny's profile card not appearing."
    ]
  },
  "6.17": {
    "added": [
      "Added new PDF download feature, so that you can save your roster to a PDF file with all the profile stats, special rules, magical powers, MWFW trackers you'll need for your game, ready to be printed off."
    ],
    "bugfixes": [
      "Fixed state not being persisted properly after undo and redo actions resulting in loss of data on refresh in certain cases.",
      "The Heralds for the King's Champion will are now correctly displayed in the MWFW tracking of Game Mode."
    ]
  },
  "6.16": {
    "added": [
      "Added undo and redo capabilities to the roster builder to help with accidental misclicks."
    ],
    "bugfixes": [
      "Fixed the alliance level shown on the roster screenshot view to prevent it from wrapping.",
      "Fixed the missing Orc Drummer from the Army of Gothmog LL when adding warriors to a warband."
    ]
  },
  "6.15": {
    "added": [
      "Revamped the faction selection and unit filters, now allowing you to search directly for heroes outside your current roster and switching the faction selection accordingly.",
      "Desktop: Added a small blueish highlight to the cards you are currently (re)selecting a unit for in the unit selector",
      "Mobile: Added an textual indicator  at the top of the screen indicating for which warband you are (re)selecting a unit for when the unit selector is active.",
      "Added a scrollbar to the unit selector to allow selection of heroes or warriors that are at the bottom of the list without having to scroll the entire roster first.",
      "Added the return to unit card functionality to the close button of the unit selector",
      "Added a border to the hero cards in the roster giving a small indication of which units are heroic. "
    ],
    "changed": [
      "Farmer Maggot now automatically includes 3 extra models to your roster counts when selecting him. Grip, Fang and Wolf no longer need to be selected as a warrior in the warband, and their profile card is now provided alongside Farmer Maggot.",
      "The armies selection dropdown in the game result dialog now also includes the faction icons."
    ],
    "bugfixes": [
      "Fixed the Arnor keyword that appears on the profile cards for Rangers of Arnor.",
      "Fixed the missing Shield option for Heralds of the Dead, in The Return of the King LL.",
      "Fixed the missing MWF badge on independent heros taken as warrior when using the normal UI mode.",
      "Fixed an issue with 'choose a warrior' buttons not being removed when reselecting the warband hero into an Independent Hero.",
      "Fixed a couple of typos on the profile cards for Rutabi and the Wild Man of Dunland."
    ]
  },
  "6.14": {
    "added": [
      "Added an option to switch between normal and dense UI mode on mobile, removing images and reducing padding and spacing"
    ],
    "changed": [
      "Removed the autoscroll behaviour for desktop and removed the smooth scrolling for mobile"
    ]
  },
  "6.13": {
    "added": [
      "Added a filter on the unit selector to search for the model you want to add",
      "Added the total Might points for all heroes in the roster info bar",
      "Added a collapse-all button to the warbands"
    ],
    "bugfixes": [
      "Fix issue with enter or tab keys not triggering match tag creation on mobile browsers"
    ],
    "changed": [
      "Added Eowyn and Merry's individual profile cards to Dernhelm.",
      "Now opens the unit selector when a new warband is created to select the hero leading that warband",
      "Now opens the unit selector when a new unit is added to immediately allow selecting the unit"
    ]
  },
  "6.12": {
    "added": [
      "Added a little bit of a bounce to the floating action button to draw attention.",
      "Added a banner at the top of the page informing users about the use of LocalStorage and the risks of losing data when the browser history is cleared",
      "Added match history with a break down of the results of previous matches"
    ],
    "changed": [
      "Changed the auto-close behaviour of the floating action button in the builder mode. It will now open onclick and only close when the next click is registered.",
      "Increased with width of the profile card and roster screenshot modals on larger screens."
    ]
  },
  "6.11": {
    "added": [
      "Added the ability to create multiple rosters and save them to the browser storage. This allows you to create multiple rosters at the same time.",
      "Gamestate is now saved for 24 hours allowing you to continue a previous game by returning to the Game Mode screen and selecting the 'continue game' option in the dialog."
    ],
    "changed": [
      "Added some smartness to the sorting of models in the totals overview; moving unique heroes to the top and grouping models of the same type together"
    ],
    "bugfixes": [
      "Fixed issue where units with additional crew where merged into one row in the totals overview"
    ],
    "removed": [
      "Removed the confirmation dialog added in 6.9 when leaving the Game Mode screen as the state is now saved between sessions."
    ]
  },
  "6.10": {
    "added": [
      "Added a toggle to the roster summary to display unit totals instead of units per warband."
    ]
  },
  "6.9": {
    "added": [
      "The application will now ask for confirmation before unloading the page while in Game Mode.",
      "Added Might, Will, Fate & Wound counters for Gandalf's Shadowfax, Thranduil's Elk and Dain's War Boar."
    ]
  },
  "6.8": {
    "added": [
      "Make it possible to drag warriors around inside or between warbands, assuming they can be part of the destination warband."
    ],
    "security": [
      "Upgraded packages used for bundling the application to remove 2 potential vulnerabilities"
    ]
  },
  "6.7": {
    "added": [
      "Collapsed warriors now display the options selected for each unit."
    ],
    "bugfixes": [
      "Fixed an issue where a Captain of Carn Dum could only be added once to your army.",
      "Alerts no longer appear behind modal backdrops.",
      "Merry and Pippin now correctly display in Game Mode when chosen as passengers on Treebeard.",
      "Fix issue with importing the White Warg's MWFW tracker when switching to Game Mode after a fresh import.",
      "Fixed the 'JSON string for army list is invalid.' error when importing a roster with 'choose a warrior' buttons."
    ]
  },
  "6.6": {
    "added": [
      "This changelog drawer with information on the changes in each Major or Minor release."
    ]
  },
  "6.5": {
    "added": [
      "Moria Dragon no longer allows you to select more than 2 options at the same time",
      "Added button to reselect a warrior in a warband spot that is already occupied, allowing you to change a unit without having to delete and recreate a new warband warrior"
    ],
    "changed": [
      "Automatic scrolling to and from the unit selection has been improved. Now scrolling directly to any duplicated warbands/warriors and between the unit selector and the warband units"
    ],
    "bugfixes": [
      "Fixed issue where \"Tough Hide\" options would not increase the wounds on the model to +2"
    ]
  },
  "6.4": {
    "added": [
      "Added extra warning messages to indicate required warband sizes for heroless warbands in the following armies: Wildmen of Druadan, Dark denizens of Mirkwood & Sharkey's Rogues."
    ],
    "bugfixes": [
      "Fixed a typo in the keywords of the Dernhelm and Rider of Rohan profile cards.",
      "Fixed an issue with the unit selector after importing a roster from file/json",
      "Fixed incorrectly deselect-able options for certain legendary legions"
    ]
  },
  "6.3": {
    "changed": [
      "Updated the text share format to fit Reddit formatting even better",
      "Update the \"copy image\" button for mobile Firefox browser to \"download image\" as copying to clipboard is not supported",
      "Added a bit of extra spacing between generated warnings to make them more readable",
      "Made the sharable text from the roster summary \"Reddit safe\""
    ],
    "bugfixes": [
      "Fixed issue with importing heroes that have (extra) Might Will Fate options",
      "Fixed issue with \"swap weapon to bow\" options not counting to the bow limit correctly",
      "Corrected the MWFW trackers for the Iron Hills Chariot with Champions of Erebor upgrade",
      "Fixed issue when selecting a new hero/warrior after importing a roster form file/json"
    ]
  },
  "6.2": {
    "added": [
      "Added alliance colours to the faction picker in the unit selection indicating which factions are Historical, Convenient or Impossible alliance with the current roster"
    ]
  },
  "6.1": {
    "added": [
      "Added an alert notifying about warbands without hero before going into gamemode",
      "Added filter on Azog's extra profile cards (The White Warg & the Signal Tower) if any of those options are not chosen"
    ],
    "changes": [
      "No longer count warbands without a leader to the total points, total units and bow limits.",
      "Make the tooltips for the floating action button in the bottom right more readable against the white background"
    ],
    "bugfixes": [
      "Fixed issue where you were not able to select warriors for the Buhrdur's horde Legendary Legion",
      "Fixed issue when warband had no hero while opening the roster summary modal",
      "Fixed issue with Azog's casualty calculation if The White Warg was not chosen as an option"
    ]
  },
  "6.0": {
    "added": [
      "<strong>Mobile support!</strong>",
      "Added extra warnings when a warrior or rider of dunharrow is leading a warband of less than 8 warriors",
      "Added a floating action button with buttons that used to be in the header"
    ],
    "changes": [
      "Converted the webpage to a PWA allowing it to be installed as a mobile or desktop application",
      "Make screenshot image of the roster table have a fixed width regardless of actual screen size",
      "Count warrior captains in heroless warbands to the units of that warband"
    ],
    "bugfixes": ["Allow Riders of the Dead to lead warbands"]
  }
}
